BAndiT1983/pic32_test/CleanProjectForCompare.X/Periphery/USBCDCDevice.h
/* 
 * File:   USBCDCDevice.h
 * Author: dev
 *
 * Created on 10 August 2019, 09:02
 */

#ifndef USBCDCDEVICE_H
#define	USBCDCDEVICE_H

#include <xc.h>
//#include <cp0defs.h>
#include <sys/attribs.h>

#define	max(a,b)	(((a) > (b)) ? (a) : (b))
#define	min(a,b)	(((a) < (b)) ? (a) : (b))

#define ASSERT(c) typedef char p__LINE__[(c)?1:-1]
#define	W(w) ((w) & 0xFF), ((w) >> 8)

#define MAXPKT 64

#define EP0TXBUFFSIZE 8 	// Multiples of 8, e.g.- 8 (x8) equals a size of 64 bytes.
#define EP1RXBUFFSIZE 8 	// Also in multiples of 8
#define EP2RXBUFFSIZE 8 	// Also in multiples of 8
#define EP3TXBUFFSIZE 8 	// Also in multiples of 8

#define EP0TXBUFFSIZE 8 	// Multiples of 8, e.g.- 8 (x8) equals a size of 64 bytes.
#define EP1RXBUFFSIZE 8 	// Also in multiples of 8
#define EP2RXBUFFSIZE 8 	// Also in multiples of 8
#define EP3TXBUFFSIZE 8 	// Also in multiples of 8

#define	LOOP_SIZE	256
#define	LOOP_MASK	(LOOP_SIZE-1)

#define	BUF_SIZE	4096
#define	BUF_MASK	(BUF_SIZE-1)

volatile int ep0tbc; // EP0 Transmit Byte Count
volatile int ep1tbc; // EP1 Transmit Byte Count
volatile int ep3tbc; // EP3 Transmit Byte Count

volatile uint8_t *ep0ptr; // EP0 Transmit Data Pointer
volatile uint8_t *ep1ptr; // EP1 Transmit Data Pointer
volatile uint8_t *ep3ptr; // EP3 Transmit Data Pointer

volatile uint8_t ep0data[EP0TXBUFFSIZE * 8]; // USB end point 0 data - USB FIFO size
volatile uint8_t ep1data[EP1RXBUFFSIZE * 8]; // USB end point 1 data - USB FIFO size
volatile uint8_t ep2data[EP2RXBUFFSIZE * 8]; // USB end point 2 data - USB FIFO size
volatile uint8_t ep3data[EP3TXBUFFSIZE * 8]; // USB end point 3 data - USB FIFO size

volatile char loop[LOOP_SIZE];
volatile unsigned loop_wi = 0;
volatile unsigned loop_ri = 0;

volatile char buf[BUF_SIZE];
volatile unsigned buf_wi = 0;
volatile unsigned buf_ri = 0;

/********************************************************************
 ** Device Descriptor						   **
 *********************************************************************/

const
unsigned char dev_desc[] = {
    0x12, // bLength: 18
    0x01, // bDescriptorType: DEVICE
    0x00, 0x02, // bcdUSB: (ver 2.0)
    0x02, // bDeviceClass: Comm
    0x00, // bDeviceSubClass: unused
    0x00, // bDeviceProtocol: unused
    0x40, // bMaxPacketSize0: 64
    0x66, 0x66, // idVendor: 0x6666
    0x34, 0x12, // idProduct: 0x1234
    0x00, 0x01, // bcdDevice: 01.00
    0x01, // iManufacturer
    0x02, // iProduct
    0x03, // iSerialNumber
    0x01 // bNumConfigurations
};

ASSERT(sizeof (dev_desc) == 0x12);

#define	TOTAL_LEN	0x43

/********************************************************************
 ** Config Descriptor						   **
 *********************************************************************/

const
unsigned char conf_desc[] = {
    0x09, // bLength: 9
    0x02, // bDescriptorType: CONFIG
    W(TOTAL_LEN), // wTotalLength: all descriptors 
    0x02, // bNumInterfaces
    0x01, // bConfigurationValue
    0x04, // iConfiguration
    0x80, // bmAttributes: bus powered
    0xc8, // bMaxPower: 400mA max

    /********************************************************************
     ** CDC Communication Interface Descriptor			   **
     *********************************************************************/

    0x09, // bLength: 9
    0x04, // bDescriptorType: INTERFACE
    0x00, // bInterfaceNumber
    0x00, // bAlternateSetting
    0x01, // bNumEndpoints
    0x02, // bInterfaceClass: Comm
    0x02, // bInterfaceSubClass: ACM
    0x00, // bInterfaceProtocol: none
    0x00, // iInterface

    /********************************************************************
     ** CDC Functional Descriptor					   **
     *********************************************************************/

    0x05, // bLength: 5
    0x24, // bDescriptorType: CS_INTERFACE
    0x00, // bDescriptorSubtype: HEADER
    0x10, 0x01, // bcdCDC

    /********************************************************************
     ** ACM Functional Descriptor					   **
     *********************************************************************/

    0x04, // bLength: 4
    0x24, // bDescriptorType: CS_INTERFACE
    0x02, // bDescriptorSubtype: ACM
    0x02, // bmCapabilities

    /********************************************************************
     ** Union Functional Descriptor					   **
     *********************************************************************/

    0x05, // bLength: 5
    0x24, // bDescriptorType: CS_INTERFACE
    0x06, // bDescriptorSubtype: UNION
    0x00, // bControlInterface: 0
    0x01, // bSubordinateInterface0: 1

    /********************************************************************
     ** Call Management Functional Descriptor			   **
     *********************************************************************/

    0x05, // bLength: 5
    0x24, // bDescriptorType: CS_INTERFACE
    0x01, // bDescriptorsubtype: CM
    0x03, // bmCapabilities: DIY
    0x01, // bDataInterface: 1

    /********************************************************************
     ** Notification Endpoint Descriptor				   **
     *********************************************************************/

    0x07, // bLength: 7
    0x05, // bDescriptorType: ENDPOINT
    0x81, // bEndpointAddress
    0x03, // bmAttributes
    0x40, 0x00, // wMaxPacketSize: 64
    0x08, // bInterval: 8

    /********************************************************************
     ** CDC Data Interface Descriptor				   **
     *********************************************************************/

    0x09, // bLength: 9
    0x04, // bDescriptorType: INTERFACE
    0x01, // bInterfaceNumber
    0x00, // bAlternateSetting
    0x02, // bNumEndpoints
    0x0A, // bInterfaceClass: Data
    0x00, // bInterfaceSubClass: unused
    0x00, // bInterfaceProtocol: none
    0x00, // iInterface

    /********************************************************************
     ** Data OUT Endpoint Descriptor					   **
     *********************************************************************/

    0x07, // bLength: 7
    0x05, // bDescriptorType: ENDPOINT
    0x02, // bEndpointAddress
    0x02, // bmAttributes
    0x00, 0x02, // wMaxPacketSize: 512
    0x01, // bInterval: 1

