BAndiT1983/pic32_test/CleanProjectForCompare.X/Periphery/USBCDCDevice.h
    /********************************************************************
     ** Data IN Endpoint Descriptor					   **
     *********************************************************************/

    0x07, // bLength: 7
    0x05, // bDescriptorType: ENDPOINT
    0x83, // bEndpointAddress
    0x02, // bmAttributes
    0x00, 0x02, // wMaxPacketSize: 512
    0x01 // bInterval: 1
};

ASSERT(sizeof (conf_desc) == TOTAL_LEN); // wTotalLength

/********************************************************************
 ** String Descriptors						   **
 *********************************************************************/

#define	STR_DESC(l)	(((((l)+1)<<1) & 0xFF) | 0x0300)

const
unsigned short string0[] = {
    STR_DESC(1), // bLength + bDescriptorType
    0x0409 // wLANGID: English (US)
};

const
unsigned short string1[] = {
    STR_DESC(11), // bLength + bDescriptorType
    'a', 'p', 'e', 'r', 't', 'u', 's', '.', 'o', 'r', 'g'
};

const
unsigned short string2[] = {
    STR_DESC(12), // bLength + bDescriptorType
    'A', 'X', 'I', 'O', 'M', ' ',
    'R', 'e', 'm', 'o', 't', 'e'
};

const
unsigned short string3[] = {
    STR_DESC(8), // bLength + bDescriptorType
    'A', 'R', '0', '0', '0', '0', '0', '1'
};

const
unsigned short string4[] = {
    STR_DESC(7), // bLength + bDescriptorType
    'D', 'e', 'f', 'a', 'u', 'l', 't'
};

const
unsigned short string5[] = {
    STR_DESC(3), // bLength + bDescriptorType
    'C', 'D', 'C'
};

static inline
void loop_ch(char ch)
{
    loop[loop_wi++ & LOOP_MASK] = ch;
}

static inline
void buf_ch(char ch)
{
    buf[buf_wi++ & BUF_MASK] = ch;
}

static inline
void buf_nl(void)
{
    buf_ch('\n');
}

static inline
void buf_hex(uint8_t hex)
{
    hex &= 0xF;
    if(hex > 9)
        buf_ch(hex + 'A' - 10);
    else
        buf_ch(hex + '0');
}

static inline
void buf_byte(uint8_t val)
{
    buf_hex(val >> 4);
    buf_hex(val);
}

static inline
void buf_word(uint16_t val)
{
    buf_byte(val >> 8);
    buf_byte(val);
}

static inline
void buf_long(uint32_t val)
{
    buf_word(val >> 16);
    buf_word(val);
}

static inline
void buf_str0(const char *str)
{
    while(*str)
        buf_ch(*str++);
}

//static inline
//void uart2_ch(char ch)
//{
//    while(U2STAbits.UTXBF);
//    U2TXREG = ch;
//}

enum
{
    S_RESET, S_IDLE, S_TXPKT, S_STATUS, S_ZERO, S_RXPKT
};


const char *sstr[] = {
    [S_RESET] = "RE",
    [S_IDLE] = "ID",
    [S_TXPKT] = "TX",
    [S_STATUS] = "ST",
    [S_ZERO] = "ZE",
    [S_RXPKT] = "RX"
};


volatile int ep0s;

volatile int ep0rbc; // EP0 Received Bytes Count
volatile int ep2rbc; // EP2 Received Bytes Count

volatile uint8_t *ptr;

volatile uint16_t bmbRequest; // bmRequestType, bRequest

volatile uint16_t wValue;
volatile uint16_t wIndex;
volatile uint16_t wLength;

volatile uint8_t dev_addr;
volatile uint8_t usb_conf;

static inline
void usb_ep1_tx(void)
{
    volatile uint8_t *ep1fifo;
    ep1fifo = (uint8_t *) & USBFIFO1; // for now 8 bits at a time.

    buf_str0("TX1\n");
    buf_ch('[');
    buf_word(ep1tbc);
    buf_ch(']');

    if(!usb_conf)
        return;

    if(!ep1tbc)
        return;

    if(USBE1CSR0bits.TXPKTRDY)
        return;

    buf_ch('|');
    for(int i = 0; i < MAXPKT; i++)
    {
        buf_byte(*ep1ptr);
        *ep1fifo = *ep1ptr++; // Load data into FIFO
        if(!--ep1tbc)
            break;
    }
    buf_ch('|');

    USBE1CSR0bits.TXPKTRDY = 1;
}

static inline
void usb_ep2_rx()
{
    ep2rbc = USBE2CSR2bits.RXCNT; // Endpoint 2 - Received Bytes Count

    buf_ch('|');
    ptr = (uint8_t *) & USBFIFO2;
    for(int i = 0; i < ep2rbc; i++)
    {
        ep2data[i] = ptr[i & 3];
        buf_byte(ep2data[i]);
    }
    buf_ch('|');

    buf_str0("RX2\n");
    USBE2CSR1bits.RXPKTRDY = 0; // Data has been unloaded
}

static inline
void usb_ep3_tx(void)
{
    volatile uint8_t *ep3fifo;
    ep3fifo = (uint8_t *) & USBFIFO3; // for now 8 bits at a time.

    buf_str0("TX3\n");
    buf_ch('[');
    buf_word(ep3tbc);
    buf_ch(']');

    if(!usb_conf)
        return;

    if(!ep3tbc)
        return;

    if(USBE3CSR0bits.TXPKTRDY)
        return;

    buf_ch('|');
    for(int i = 0; i < MAXPKT; i++)
    {
        buf_byte(*ep3ptr);
        *ep3fifo = *ep3ptr++; // Load data into FIFO
        if(!--ep3tbc)
            break;
    }
    buf_ch('|');

    USBE3CSR0bits.TXPKTRDY = 1;
}




#define	USB_EP0_TX(s) do {		\
	ep0ptr = (uint8_t *)(s);	\
	ep0tbc = *ep0ptr;		\
	} while(0)

#define	USB_EP0_TXL(s, l) do {		\
	ep0ptr = (uint8_t *)(s);	\
	ep0tbc = (l);			\
	} while(0)

#define	USB_EP3_TXL(s, l) do {		\
	ep3ptr = (uint8_t *)(s);	\
	ep3tbc = (l);			\
	} while(0)

static inline
int usb_ep0_ctrl_read(void)
{
    int ret = 0;

    buf_str0("\nCR:");
    buf_word(bmbRequest);
    buf_ch(',');
    buf_word(wValue);
    buf_ch(',');
    buf_word(wIndex);
    buf_ch(',');
    buf_word(wLength);

    switch(bmbRequest)
    {
        case 0x8006: // Get Descriptor(s)
            buf_str0("[GET_DESC]");

            switch(ep0data[3])
            {
                case 0x00: // Undefined
                    break;

                case 0x01: // Device Descriptor
                    buf_str0("[DEVICE]");

                    USB_EP0_TXL(dev_desc, min(wLength, sizeof (dev_desc)));
                    ret = 1;
                    break;

                case 0x02: // Configuration Descriptor
                    buf_str0("[CONFIG]");

                    USB_EP0_TXL(conf_desc, min(wLength, TOTAL_LEN));
                    ret = 1;
                    break;

                case 0x03: // String Descriptors
                    buf_str0("[STRING]");

                    switch(ep0data[2])
                    {
                        case 0x00: // Language ID
                            USB_EP0_TX(string0);
                            ret = 1;
                            break;

                        case 0x01: // Manufacturer
                            USB_EP0_TX(string1);
                            ret = 1;
                            break;

