BAndiT1983/pic32_test/CleanProjectForCompare.X/Periphery/USBCDCDevice.h
                        case 0x02: // Product
                            USB_EP0_TX(string2);
                            ret = 1;
                            break;

                        case 0x03: // Serial
                            USB_EP0_TX(string3);
                            ret = 1;
                            break;

                        case 0x04: // Configuration
                            USB_EP0_TX(string4);
                            ret = 1;
                            break;

                        case 0x05: // Interface
                            USB_EP0_TX(string5);
                            ret = 1;
                            break;

                        default:
                            break;
                    } // End of switch ep0data[2]
                    break;

                default:
                    break;

            } // End of switch ep0data[3].
            break;

        default:
            buf_str0("[UNKNOWN]");
            break;
    } // End of switch bmbRequest.

    buf_ch(';');
    buf_word(ep0tbc);
    buf_ch('#');
    buf_hex(ret);
    buf_nl();

    return ret;
}

static inline
int usb_ep0_ctrl_write(void)
{
    int ret = 0;

    buf_str0("\nCW:");
    buf_word(bmbRequest);
    buf_ch(',');
    buf_word(wValue);
    buf_ch(',');
    buf_word(wIndex);
    buf_ch(',');
    buf_word(wLength);
    buf_ch(' ');

    switch(bmbRequest)
    {
        case 0x0008: // Get Configuration
            buf_str0("[GET_CONFIGURATION]");
            ret = 1;
            break;

        case 0x2120: // CDC Set Line Coding
            buf_str0("[CDC_SET_LINE_CODING]");
            ret = 1;
            break;

        default:
            buf_str0("[UNKNOWN]");
            break;
    }

    buf_ch('#');
    buf_hex(ret);
    buf_nl();

    return ret;
}

static inline
int usb_ep0_zero(void)
{
    int ret = 0;

    buf_str0("\nCZ:");
    buf_word(bmbRequest);
    buf_ch(',');
    buf_word(wValue);
    buf_ch(',');
    buf_word(wIndex);
    buf_ch(' ');

    switch(bmbRequest)
    {
        case 0x0001: // Clear Feature
            buf_str0("[CLEAR_FEATURE]");
            ret = 1;
            break;

        case 0x0003: // Set Feature
            buf_str0("[SET_FEATURE]");
            ret = 1;
            break;

        case 0x0005: // Save Address
            buf_str0("[SAVE_ADDRESS]");
            dev_addr = wValue & 0xFF;
            ret = 1;
            break;

        case 0x0009: // Set Configuration
            buf_str0("[SET_CONFIGURATION]");
            usb_conf = wValue & 0xFF;
            ret = 1;
            break;

        case 0x2122: // CDC Set Control Line State
            buf_str0("[CDC_SET_CONTROL_LINE_STATE]");
            ret = 1;
            break;

        default:
            buf_str0("[UNKNOWN]");
            break;
    }

    buf_ch('#');
    buf_hex(ret);
    buf_nl();

    return ret;
}



#define	EP0_STATE(s) do {	\
	int next = (s);		\
	buf_ch('{');		\
	buf_str0(sstr[ep0s]);	\
	buf_str0("->");		\
	buf_str0(sstr[next]);	\
	buf_ch('}');		\
	ep0s = next;		\
	} while (0)

static inline
int usb_ep0_tx(void)
{
    volatile uint8_t *ep0fifo;
    ep0fifo = (uint8_t *) & USBFIFO0; // for now 8 bits at a time.

    buf_ch('[');
    buf_word(ep0tbc);
    buf_ch(']');

    // buf_ch('|');
    for(int i = 0; i < MAXPKT; i++)
    {
        // buf_byte(*ep0ptr);
        *ep0fifo = *ep0ptr++; // Load data into FIFO
        if(!--ep0tbc)
            break;
    }
    // buf_ch('|');

    if(ep0tbc)
    { // more to come
        buf_ch('+');
        USBE0CSR0bits.TXRDY = 1;
        return S_TXPKT;

    }
    else
    { // last packet
        buf_ch('/');
        USBE0CSR0 |= _USBE0CSR0_TXRDY_MASK | _USBE0CSR0_DATAEND_MASK;

        // USBE0CSR0bits.TXRDY = 1;
        // USBE0CSR0bits.DATAEND = 1;
        return S_STATUS;
    }
}

static inline
void usb_ep0_addr(void)
{
    if(dev_addr && !USBCSR0bits.FUNC)
    {
        buf_str0("ADDR=");
        buf_word(dev_addr);
        buf_nl();

        USBCSR0bits.FUNC = dev_addr & 0x7F;
    }
}

static inline
void usb_ep0_stall(void)
{
    buf_str0("STALL");
    USBE0CSR0bits.STALL = 1;
}

static inline
void usb_ep0_flush(void)
{
    buf_str0("FLUSH");
    USBE0CSR0bits.FLUSH = 1;
}

static inline
void usb_ep0(void)
{
    buf_ch('(');
    buf_word(USBE0CSR0 >> 16);
    buf_ch(')');

    if(ep0s == S_RESET)
        EP0_STATE(S_IDLE);

    if(USBE0CSR0bits.SETEND)
    {
        USBE0CSR0bits.SETENDC = 1;
        buf_str0("SETEND-");
        if(ep0s != S_ZERO)
            EP0_STATE(S_IDLE);
    }

    if(USBE0CSR0bits.STALLED)
    {
        buf_str0("STALLED");
        USBE0CSR0bits.STALLED = 0;
        return;
    }

    switch(ep0s)
    {
        case S_TXPKT: // Transmit Packet
            EP0_STATE(usb_ep0_tx());
            return;

        case S_ZERO: // Zero Status
        case S_STATUS: // Status
            usb_ep0_addr();
            EP0_STATE(S_IDLE);
            return;
    }

    if(!USBE0CSR0bits.RXRDY)
    {
        buf_ch('!');
        return;
    }

    ep0rbc = USBE0CSR2bits.RXCNT; // Received Bytes Count

    if(ep0rbc > MAXPKT)
    {
        usb_ep0_stall();
        EP0_STATE(S_IDLE);
        return;
    }

    buf_ch('|');
    ptr = (uint8_t *) & USBFIFO0;
    for(int i = 0; i < ep0rbc; i++)
    {
        ep0data[i] = ptr[i & 3];
        buf_byte(ep0data[i]);
    }
    buf_ch('|');

    switch(ep0s)
    {
        case S_IDLE: // Idle State
            if(ep0rbc != 8)
            {
                usb_ep0_flush();
                return;
            }

            bmbRequest = (ep0data[0] << 8) | ep0data[1];
            wValue = (ep0data[3] << 8) | ep0data[2];
            wIndex = (ep0data[5] << 8) | ep0data[4];
            wLength = (ep0data[7] << 8) | ep0data[6];

            if(wLength == 0)
            {
                if(usb_ep0_zero())
                {
                    USBE0CSR0 |= _USBE0CSR0_RXRDYC_MASK | _USBE0CSR0_DATAEND_MASK;

                    // USBE0CSR0bits.RXRDYC = 1;
                    // USBE0CSR0bits.DATAEND = 1;
                    EP0_STATE(S_ZERO);
                    return;

