BAndiT1983/pic32_test/CleanProjectForCompare.X/Periphery/USBCDCDevice.h
                }
                else
                {
                    usb_ep0_stall();
                    return;
                }
            }

            if(bmbRequest & 0x8000)
            { // control read
                if(usb_ep0_ctrl_read())
                {
                    USBE0CSR0bits.RXRDYC = 1;
                    EP0_STATE(usb_ep0_tx());

                }
                else
                {
                    usb_ep0_stall();
                }

            }
            else
            { // control write
                USBE0CSR0bits.RXRDYC = 1;
                EP0_STATE(S_RXPKT);
            }
            break;

        case S_RXPKT: // Receive Packet

            /* TODO: handle multiple packets */

            usb_ep0_ctrl_write();
            USBE0CSR0 |= _USBE0CSR0_RXRDYC_MASK | _USBE0CSR0_DATAEND_MASK;

            // USBE0CSR0bits.RXRDYC = 1;
            // USBE0CSR0bits.DATAEND = 1;
            EP0_STATE(S_IDLE);
            break;
    }
}

static inline
void usb_reset_ep0(void)
{
    USBCSR3bits.ENDPOINT = 0;
    USBE0CSR0 = 0;
    USBFIFOAbits.RXFIFOAD = 0x00;
    USBFIFOAbits.TXFIFOAD = 0x08;
    USBOTGbits.TXFIFOSZ = 3;
    USBOTGbits.RXFIFOSZ = 3;
    USBCSR1bits.EP0IE = 1;
}

static inline
void usb_reset_ep1(void)
{
    USBE3CSR0bits.MODE = 1;
    USBE3CSR0bits.TXMAXP = EP3TXBUFFSIZE;
    USBE3CSR2bits.PROTOCOL = 3;

    USBCSR3bits.ENDPOINT = 1;
    USBFIFOAbits.TXFIFOAD = 0x010;
    USBCSR3bits.ENDPOINT = 0;
    USBE3CSR3bits.TXFIFOSZ = 0x6;

    USBE3CSR2bits.SPEED = 1;
    USBE3CSR0bits.ISO = 0;
    USBCSR1bits.EP3TXIE = 1;
}

static inline
void usb_reset_ep2(void)
{
    USBE2CSR0bits.MODE = 0;
    USBE2CSR1bits.RXMAXP = EP2RXBUFFSIZE;
    USBE2CSR3bits.PROTOCOL = 2;

    USBCSR3bits.ENDPOINT = 2;
    USBFIFOAbits.RXFIFOAD = 0x020;
    USBCSR3bits.ENDPOINT = 0;
    USBE2CSR3bits.RXFIFOSZ = 0x9;

    USBE2CSR3bits.SPEED = 1;
    USBE2CSR1bits.ISO = 0;
    USBCSR2bits.EP2RXIE = 1;
}

static inline
void usb_reset_ep3(void)
{
    USBE3CSR0bits.MODE = 1;
    USBE3CSR0bits.TXMAXP = EP3TXBUFFSIZE;
    USBE3CSR2bits.PROTOCOL = 2;

    USBCSR3bits.ENDPOINT = 3;
    USBFIFOAbits.TXFIFOAD = 0x030;
    USBCSR3bits.ENDPOINT = 0;
    USBE3CSR3bits.TXFIFOSZ = 0x9;

    USBE3CSR2bits.SPEED = 1;
    USBE3CSR0bits.ISO = 0;
    USBCSR1bits.EP3TXIE = 1;
}

static inline
void usb_reset(void)
{
    buf_str0("RESET");

    dev_addr = 0;
    usb_conf = 0;

    USBCSR0bits.FUNC = 0;
    usb_reset_ep0();
    usb_reset_ep1();
    usb_reset_ep2();
    usb_reset_ep3();

    EP0_STATE(S_RESET);
}

extern "C" void __ISR(_USB_VECTOR, IPL7SRS) USB_ISR(void)
{
    uint32_t csr0 = USBCSR0;
    uint32_t csr1 = USBCSR1;
    uint32_t csr2 = USBCSR2;
    // IFS4CLR = _IFS4_USBIF_MASK;		// Reset the USB Interrupt flag

    buf_ch('<');
    buf_word(csr0 >> 8);
    buf_ch(':');
    buf_byte(csr1);
    buf_ch(':');
    buf_byte(csr2 >> 16);
    buf_ch('.');

    /* Endpoint 0 Interrupt Handler */
    if(csr0 & _USBCSR0_EP0IF_MASK)
    {
        usb_ep0();
    }

    /* Endpoint 1 TX Interrupt Handler */
    if(csr0 & _USBCSR0_EP1TXIF_MASK)
    { // Endpoint 1 Transmit.
        usb_ep1_tx();
    }

    /* Endpoint 2 RX Interrupt Handler */
    if(csr1 & _USBCSR1_EP2RXIF_MASK)
    { // Endpoint 2 Receive
        usb_ep2_rx();
        buf_ch('*');
        buf_word(ep2rbc);
        buf_ch('*');
        /* for (int i=0; i<ep2rbc; i++)
            loop_ch(ep2data[i]); */
        loop_ch(ep2data[0]);
    }

    /* Endpoint 3 TX Interrupt Handler */
    if(csr0 & _USBCSR0_EP3TXIF_MASK)
    { // Endpoint 3 Transmit
        usb_ep3_tx();
    }

    if(csr2 & _USBCSR2_RESETIF_MASK)
    { // Bus Reset
        usb_reset();
    }

    buf_ch('>');
    buf_nl();

    IFS4CLR = _IFS4_USBIF_MASK; // Reset the USB Interrupt flag
}

//void __attribute__((vector(_UART2_RX_VECTOR), interrupt(IPL6SRS))) uart2_isr(void) {
//    while (U2STAbits.URXDA) { // process buffer 
//        char ch = U2RXREG;
//
//        uart2_ch(ch); // echo back
//    }
//
//    IFS4CLR = _IFS4_U2RXIF_MASK; // clear UART2 Rx IRQ
//}

class USBCDCDevice
{
public:
    //    void Initialize();
    //    
    //    void Process();

    void Initialize(void)
    {
        USBCSR0bits.SOFTCONN = 0; // USB D+/D- lines are disabled and tristated

        USBCSR2bits.RESETIE = 1; // ?? When enabled IN packets/Set Address aren't received (unknown reason).
        USBCSR2bits.RESUMEIE = 0; // ?? When enabled IN packets/Set Address aren't received (unknown reason).

        USBCSR0bits.EP0IF = 0; // clear interrupt
        USBCSR1bits.EP1RXIF = 0; // clear interrupt
        USBCSR0bits.EP2TXIF = 0; // clear interrupt
        USBCSR1bits.EP3RXIF = 0; // clear interrupt

        IPC33bits.USBIP = 7; // USB Interrupt Priority.
        IPC33bits.USBIS = 1; // USB Interrupt Sub-Priority.

        USBCSR0bits.FUNC = 0; // USB address = 0

        IFS4bits.USBIF = 0; // Clear the USB interrupt flag.
        IEC4bits.USBIE = 1; // Enable the USB interrupt.

        USBCSR0bits.HSEN = 1; // 1 = Enable High Speed (480Mbps) USB mode.
        USBCSR0bits.SOFTCONN = 1; // USB D+/D- lines are enabled and active
    }

    void Process()
    {
        if(!ep3tbc)
        {
            unsigned cnt = 0;

            while((loop_ri != loop_wi) && (cnt < 16))
                ep3data[cnt++] = loop[loop_ri++ & LOOP_MASK] + 1;

            if(cnt)
            {
                ep3tbc = cnt;
                ep3ptr = ep3data;
                usb_ep3_tx();
            }
        }
    }

    void Send(uint8_t* data, uint16_t length)
    {
        ep3tbc = length;
        ep3ptr = data;
        usb_ep3_tx();
    }
};

//void init_usb(void) {
//    USBCSR0bits.SOFTCONN = 0; // USB D+/D- lines are disabled and tristated
//
//    USBCSR2bits.RESETIE = 1; // ?? When enabled IN packets/Set Address aren't received (unknown reason).
//    USBCSR2bits.RESUMEIE = 0; // ?? When enabled IN packets/Set Address aren't received (unknown reason).
//
//    USBCSR0bits.EP0IF = 0; // clear interrupt
//    USBCSR1bits.EP1RXIF = 0; // clear interrupt
//    USBCSR0bits.EP2TXIF = 0; // clear interrupt
//    USBCSR1bits.EP3RXIF = 0; // clear interrupt
//
//    IPC33bits.USBIP = 7; // USB Interrupt Priority.
//    IPC33bits.USBIS = 1; // USB Interrupt Sub-Priority.
//
//    USBCSR0bits.FUNC = 0; // USB address = 0
//
//    IFS4bits.USBIF = 0; // Clear the USB interrupt flag.
//    IEC4bits.USBIE = 1; // Enable the USB interrupt.
//
//    USBCSR0bits.HSEN = 1; // 1 = Enable High Speed (480Mbps) USB mode.
//    USBCSR0bits.SOFTCONN = 1; // USB D+/D- lines are enabled and active
//}
//
//void process_usb() {
//    if (!ep3tbc) {
//        unsigned cnt = 0;
//
//        while ((loop_ri != loop_wi) && (cnt < 16))
//            ep3data[cnt++] = loop[loop_ri++ & LOOP_MASK] + 1;
//
//        if (cnt) {
//            ep3tbc = cnt;
//            ep3ptr = ep3data;
//            usb_ep3_tx();
//        }
//    }
//}
#endif	/* USBCDCDEVICE_H */

